Revit 2027 API
PointCloudOverrides.GetPointCloudRegionOverrideSettings(ElementId) Method
 Gets region override settings assigned to the whole PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudOverrideSettings GetPointCloudRegionOverrideSettings(
	ElementId elementId
)
Public Function GetPointCloudRegionOverrideSettings (
	elementId As ElementId
) As PointCloudOverrideSettings
public:
PointCloudOverrideSettings^ GetPointCloudRegionOverrideSettings(
	ElementId^ elementId
)
member GetPointCloudRegionOverrideSettings :
        elementId : ElementId -> PointCloudOverrideSettings
Parameters
elementId ElementId
 Id of the overridden element.
Return Value
PointCloudOverrideSettings
 The override settings assigned to the element, if present, or a default override settings if nothing was found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
GetPointCloudRegionOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace